[{"funniness":"0","coolness":"0","usefulness":"0","review":"\"We stopped on the way to our hotel and it was a mistake"},{"funniness":"0","coolness":"0","usefulness":"0","review":"\"We were STARVING on Good Friday and were really struggling to find something to eat that was meatless for her.  Didn't want fried fish and pasta was a long"},{"funniness":"0","coolness":"0","usefulness":"0","review":"\"They have good food. I like the Coke Freestyle machine. The food is delicious"},{"funniness":"0","coolness":"0","usefulness":"0","review":"\"Waaaaaaaay better than Chipotle. Cheaper"},{"funniness":"0","coolness":"0","usefulness":"0","review":"\"This place is awful the workers acted bothered that I would patronize their restaurant when it was empty at 6:00pm. The food was awful"},{"funniness":"0","coolness":"0","usefulness":"0","review":"\"They food is very fresh"},{"funniness":"0","coolness":"0","usefulness":"0","review":"\"Let's face it there are a lot of Tex-Mex Fast grill places these days. There are 2 things that set this location apart from the competition... really amazing cheese or \"\"queso\"\" sauce and the Coca-Cola freestyle drink machine\""},{"funniness":"0","coolness":"0","usefulness":"0","review":"\"First time here..... Food is alright. Nothing special. Employees do not pay any attention to what they are supposed to be doing. For example. They asked... What would I like. I said Steak Burrito. Then she asks again... I replied"},{"funniness":"0","coolness":"0","usefulness":"0","review":"\"This location just opened across from Progressive Insurance and real close to 271 on Wilson Mills. The food was very good - they have many more options than Chipotle"},{"funniness":"0","coolness":"0","usefulness":"0","review":"\"I was craving for spicy food. I ordered Gumbo with pulled pork. The meat is tender and smoky building a nice base for the gumbo.\""},{"funniness":"0","coolness":"0","usefulness":"0","review":"\"Worst service ever. Ordered through UberEATS and they completely messed the order up. Nothing in the order said guac yet there's guac on the burrito? The order CLEARLY states no rice or beans yet there they are.... what a joke. Lost our business.\""}]